# First print your name in the cell below then save this file. (or something nice about your instructor)

In [5]:
# In this cell print your name 

print("hussam's great")

# Data wrangling with Pandas exercise
* For this exercise we will be using the `listings.csv` data file.

In [2]:
import pandas as pd
import numpy as np

# Load in the data file using `pd.read_csv()`

In [10]:
# Load data here

df= pd.read_csv('data/listings.csv')

## Exercise 2 - Filtering

Return the following subsets of the dataframe.

1. How many listings are there with a price less than 100? 


2. Find how many listings there are in just Brooklyn.


3. Find how many listings there are in Brooklyn with a price less than 100.


4. Using `.isin()` select anyone that has the host name of Michael, David, John, and Daniel.


5. Create a new column called `adjusted_price` that has $100 added to every listing in Williamsburg.  The prices for all other listings should be the same as the were before. 


6. What % of the rooms are private, and what % of the rooms are shared.  
    * Hint, use `.value_counts()`

In [36]:
# 1. How many listings are there with a price less than 100? 
#df.head()
Price_over_100=( df['price']<100 ).sum() 
print(Price_over_100)

22778

In [42]:
# 2. Make a new DataFrame of listings in Brooklyn named `df_bk` 
# and find how many listings in just Brooklyn.

df.head()
df_bk = df[df['neighbourhood_group'] == 'Brooklyn']
df_bk.head()

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
1,3831,"Whole flr w/private bdrm, bath & kitchen(pls r...",4869,LisaRoxanne,Brooklyn,Clinton Hill,40.68514,-73.95976,Entire home/apt,75,1,340,2020-08-01,4.75,1,265
2,5121,BlissArtsSpace!,7356,Garon,Brooklyn,Bedford-Stuyvesant,40.68688,-73.95596,Private room,60,29,50,2019-12-02,0.37,1,365
3,5136,"Spacious Brooklyn Duplex, Patio + Garden",7378,Rebecca,Brooklyn,Sunset Park,40.66120,-73.99423,Entire home/apt,175,14,1,2014-01-02,0.01,1,295
8,5803,"Lovely Room 1, Garden, Best Area, Legal rental",9744,Laurie,Brooklyn,South Slope,40.66829,-73.98779,Private room,88,4,180,2020-03-18,1.31,3,344
11,6848,Only 2 stops to Manhattan studio,15991,Allen & Irina,Brooklyn,Williamsburg,40.70837,-73.95352,Entire home/apt,109,2,181,2020-03-16,1.32,1,0

In [44]:
# 3. Find how many listings there are in Brooklyn with a price less than 100.

count = (df['price'] <100 ) .sum()
print(count)

22778

In [51]:
# 4. Using `.isin()` select anyone that has the host name of Michael, David, John, and Daniel.
# How many total are there that have those names
df.head()
Names =['Michael','David','John','Daniel']
selected_hosts = df[df['host_name'].isin(Names)]
selected_hosts.head()
count=df['host_name'].isin(Names) .sum()
print(count)

1258

In [74]:
# 5. Create a new column called `adjusted_price` that has $100 added to every listing in Williamsburg.  
# The prices for all other listings should be the same as the were before. 
df.head()
Wlisting =df [df['neighbourhood'].isin(['Williamsburg']) ]
otherListing= df[~df['neighbourhood'].isin(['Williamsburg'])]
df["adjusted_price"]= Wlisting['price']+100
df['adjusted_price']=otherListing['price']
Wlisting.head()
otherListing.head()
df.head()
#df['adjusted_price'] =

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365,adjusted_price
0,2595,Skylit Midtown Castle,2845,Jennifer,Manhattan,Midtown,40.75362,-73.98377,Entire home/apt,175,3,48,2019-11-04,0.37,2,365,175.0
1,3831,"Whole flr w/private bdrm, bath & kitchen(pls r...",4869,LisaRoxanne,Brooklyn,Clinton Hill,40.68514,-73.95976,Entire home/apt,75,1,340,2020-08-01,4.75,1,265,75.0
2,5121,BlissArtsSpace!,7356,Garon,Brooklyn,Bedford-Stuyvesant,40.68688,-73.95596,Private room,60,29,50,2019-12-02,0.37,1,365,60.0
3,5136,"Spacious Brooklyn Duplex, Patio + Garden",7378,Rebecca,Brooklyn,Sunset Park,40.66120,-73.99423,Entire home/apt,175,14,1,2014-01-02,0.01,1,295,175.0
4,5178,Large Furnished Room Near B'way,8967,Shunichi,Manhattan,Hell's Kitchen,40.76489,-73.98493,Private room,65,2,473,2020-03-15,3.44,1,340,65.0

In [104]:
# 6. What % of the rooms are private, and what % of the rooms are shared.  
df.head()
dfp=  df [(df['room_type'].isin(['Private room','Shared room']))]
dfp = dfp.room_type.value_counts(normalize=True)
dfp

room_type
Private room    0.955402
Shared room     0.044598
Name: proportion, dtype: float64

# Exercise 3 - Grouping

1. Using `groupby`, count how many listings are in each neighbourhood_group.


2. Using `groupby`, find the mean price for each of the neighbourhood_groups. 


3. Using `groupby` and `.agg()`, find the min and max price for each of the neighbourhood_groups. 


4. Using `groupby`, find the median price for each room type in each neighbourhood_group.


5. Using `groupby` and `.agg()`, find the count, min, max, mean, median, and std of the prices for each room type in each neighbourhood_group.

In [125]:
# 1. Using `groupby`, count how many listings are in each neighbourhood_group.

Listingss= df.groupby('neighbourhood_group').size()

print(Listingss)

neighbourhood_group
Bronx             1183
Brooklyn         18632
Manhattan        20580
Queens            5791
Staten Island      341
dtype: int64

In [138]:
# 2. Using `groupby`, find the mean price for each of the neighbourhood_groups. 


Listingss= df.groupby('neighbourhood_group')['price'].mean()
#Listingss= Listingss['price'].mean()
Listingss.head()

neighbourhood_group
Bronx             92.751479
Brooklyn         120.225258
Manhattan        191.880466
Queens            99.754965
Staten Island    110.947214
Name: price, dtype: float64

In [140]:
# 2.5. Using `groupby`, find the mean price for each room_type. 
Listingss= df.groupby('room_type')['price'].mean()
Listingss

room_type
Entire home/apt    199.395950
Hotel room         275.015075
Private room        91.453084
Shared room         87.063830
Name: price, dtype: float64

In [143]:
# 3. Using `groupby` and `.agg()`, find the min and max price for each of the neighbourhood_groups. 
min_max= df.groupby('neighbourhood_group')['price'].agg(['min','max'])
min_max.head()

                     min    max
neighbourhood_group
Bronx                 16   1404
Brooklyn               0  10000
Manhattan              0  10000
Queens                 0  10000
Staten Island         19   1200

In [146]:
# 4. Using `groupby`, find the mean price for each room_type in each neighbourhood_group.
Mean_price=df.groupby(['neighbourhood_group','room_type'])['price'].mean()
Mean_price

neighbourhood_group  room_type
Bronx                Entire home/apt    138.004819
                     Private room        68.419668
                     Shared room         66.391304
Brooklyn             Entire home/apt    171.587687
                     Hotel room         147.300000
                     Private room        71.291189
                     Shared room         57.870091
Manhattan            Entire home/apt    231.335572
                     Hotel room         292.515670
                     Private room       128.277069
                     Shared room        111.735084
Queens               Entire home/apt    150.168900
                     Hotel room         139.058824
                     Private room        69.972564
                     Shared room         89.891892
Staten Island        Entire home/apt    151.720930
                     Private room        70.312883
                     Shared room         46.000000
Name: price, dtype: float64

In [149]:
# 5. Using `groupby` and `.agg()`, find the count, min, max, mean, median, and std of the prices 
# for each room type in each neighbourhood_group.

aggr=['min','max','median','mean','count','std']

RoomKind= df.groupby('neighbourhood_group')['price'].agg(aggr)

RoomKind

                     min    max  median        mean  count         std
neighbourhood_group
Bronx                 16   1404    69.0   92.751479   1183   95.787081
Brooklyn               0  10000    90.0  120.225258  18632  180.136376
Manhattan              0  10000   129.0  191.880466  20580  428.682578
Queens                 0  10000    70.0   99.754965   5791  207.648739
Staten Island         19   1200    79.0  110.947214    341  122.676152

# Load, Merge, and Export files.
1. Load the `prices.csv` and the `n_listings.csv`
    * Having an error..? Inspect the actual csv file if you're having trouble

2. Do join that keeps all the records for each table.
    * Neighbourhood groups should include ['Bronx', 'Brooklyn', 'Manhattan', 'Queens', 'Staten Island',
       'LongIsland']

       
3. Save your joined csv as `joined.csv` into the data folder. 


4. Load your saved table and see if it looks the same or different that the DataFrame you used to create it.

In [165]:
# 1. Load the `prices.csv` and the `n_listings.csv`
df1=pd.read_csv('data/prices.csv')


df2=pd.read_csv('data/n_listings.csv',sep=';')
df1.head() 
#df2.head()

  neighbourhood_group   mean_price
0               Bronx    92.751479
1            Brooklyn   120.225258
2           Manhattan   191.880466
3              Queens    99.754965
4       Staten Island   110.947214

In [166]:
# 2. Do join that keeps all the records for each table.
#merge_df = pd.merge(dfprices, dflistings, on='neighbourhood_group')
merge_df= pd.merge(df1, df2, on='neighbourhood_group')
merge_df

  neighbourhood_group   mean_price  n_listings
0               Bronx    92.751479        1183
1            Brooklyn   120.225258       18632
2           Manhattan   191.880466       20580

In [169]:
# 3. Save your joined csv as `joined.csv` into the data folder. 

save_as="data/myFile.csv"
merge_df.to_csv(save_as, index=False)

In [171]:
# 4. Load your newly saved file, see if it looks the same.  If not, try saving with argument `index=False`

new_file= pd.read_csv('data/myfile.csv')
new_file.head()

  neighbourhood_group   mean_price  n_listings
0               Bronx    92.751479        1183
1            Brooklyn   120.225258       18632
2           Manhattan   191.880466       20580

# Extra Credit
Every question below this cell is extra credit and optional.

### 1. (Easy) Explore this new PandasAI Package and tell me what its all about because I've never used it. 
* https://www.youtube.com/watch?v=5w6eZaoDVVk&ab_channel=CodingIsFun  
* See if you can use it on the listings.csv to find out some cool info. or answer some of the questions above.

### 2. (Very Easy) Find other cool Panda packages / add ons and show us what they can do well. And how you installed them.

### 3. (Medium) Use the grammys.csv data for the next section of questions.

1. Who was won Album of the Year in 2016?


2. Who won Best Rap Album in 2009?


3. How many awards was Kendrick Lamar nomiated for, and how many did he win...?

### (Hard) Load the Game Logs for 2022 and add the column names using a dictionary.  
* [Link to the data page](https://www.retrosheet.org/gamelogs/)
* [Link to the column names](https://procatinator.com/)
* haha, gotta find them yourself!

### (Extra Hard) Download the files for the past 5 years into a new folder and add them all into one data frame using pandas, then save that new file.
* Try to not hard code in the file names. We want to do this programmatically because what if we want to add new/more file names in the future.